[t,x] = ode45('ode',[0 10],[0 0 0]);
%[t,x] = ode45('ode',[0 10],[1 -0.4 0.2]);

%y = ones(size(t));
%plot(t,x(:,1),'b-',t,x(:,2),'g-',t,x(:,3),'y-',t,y,'LineWidth',3);
plot(t,x(:,1),'b-',t,x(:,2),'g-',t,x(:,3),'y-',t,sin(t),'LineWidth',3);

legend('x_1(t)','x_2(t)','x_3(t)');
grid on;
xlabel('t, c');
ylabel('x_i(t)');

%title('Реакция системы на входной сигнал y=1 при начальных условиях [0 0 0]');
title('Реакция системы на входной сигнал y=sin(t) при начальных условиях [0 0 0]');
%title('Реакция системы на входной сигнал y=1 при начальных условиях [1 -0.4 0.2]');
%title('Реакция системы на входной сигнал y=sin(t) при начальных условиях [1 -0.4 0.2]');